#include <stdio.h>

int main(void)
{
    /*
        // 0. 포인터란? 주소를 저장하는 변수. (즉, 어떤 변수를 가리키는 주소를 저장하는 변수)
        // 포인터는 주소를 저장하는 변수이기 때문에, 포인터 변수는 주소를 저장할 수 있는 크기만큼의 메모리 공간을 할당받음

        // 1. 일반 변수 선언
        int *p; // int *p : int 형을 가리키는 포인터 변수
                // p : 포인터 변수 (주소를 담는 변수 자체)
        int x = 30;
        p = &x; // 'x'의 주소를 p에 저장 (즉, p는 x를 가리킴)

        // 포인터를 정수형으로 강제 출력
        // 포인터 int를 %d로 출력하면 포인터를 강제로 정수로 해석해서 결과가 나오긴 하지만, 권장하진 않음.
        // 그러나 주소 값이 int형 보다 큰 경우에 음수로 해석될 수 있음
        printf("%d\n", p);  // 변수 'x'의 주소값(임의로 할당된 값) 출력
        printf("%d\n", &p); // 포인터 p의 주소값(임의로 할당된 값) 자체를 출력
        printf("%d\n", *p); // 포인터 p가 가리키는 실제값 (즉, 변수 'x'의 값(30)) 출력 -> 역참조라고 함

        // 타입이 없는 포인터로 정상적으로 출력
        // (void*)라고 선언 하면 타입이 없는 포인터임 (즉, 어떤 타입의 데이터든 가리킬 수 있는 범용 포인터)
        printf("%p\n", (void *)p);
        printf("%p\n", (void *)&p);
        printf("%d\n", *p);

        // 포인터 출력 시 주의사항
        // printf 는 인자를 포맷 문자열로 변환하여 출력하기 때문에, p를 출력형을 지정하지 않으면 p를 문자열로 간주
        // ex. printf(p); // p를 문자열로 간주하여 출력
        // 메모리를 문자열처럼 해석하다가 이상한 결과가 나오거나 크래시됨
    */

    // 2. 배열 변수 선언
    int arr[3] = {5, 10, 15};
    int *ptr = arr;
    for (int i = 0; i < 3; i++)
    {
        // 배열의 값 확인
        printf("배열 arr[%d]의  값 : %d\n", i, arr[i]);
        printf("배열 *(arr+[%d])의  값 : %d\n", i, *(arr + i));
        printf("ptr[%d]의  값 : %d\n", i, ptr[i]);
        printf("*(ptr+[%d])의  값 : %d\n\n", i, *(ptr + i));

        // 배열의 주소 확인
        printf("배열 arr[%d]의  주소 : %p\n", i, arr[i]);
        printf("ptr[%d]의  주소 : %p\n\n", i, ptr[i]);
    }

    printf("\n---------------------------------\n\n");

    // 배열 자체를 출력했을 때의 값 = 배열 첫번째 요소를 출력했을 때의 값
    printf("배열 arr의 값 : %d\n", *arr);
    printf("배열 arr[%d]의 첫번째 값 : %d\n", 0, arr[0]);
    printf("ptr의 값 : %d\n", *ptr);
    printf("ptr[%d]의 첫번째 값 : %d\n\n", 0, ptr[0]);

    // 위의 결과에 주소 값을 각각 확인
    printf("배열 arr의 주소 : %d\n", &arr);
    printf("배열 arr[%d]의 첫번째 값 : %d\n", 0, &arr[0]);
    printf("ptr의 주소 : %d\n", &ptr); // // 포인터 변수 ptr의 실제 주소는 arr와 다름 
    printf("ptr[%d]의 첫번째 값 : %d\n\n", 0, &ptr[0]);
}

// 🔄 포인터 요약
// p     : 변수 x의 주소
// *p    : x의 값 (역참조)
// &p    : 포인터 변수 p 자체의 주소
// %d    : 정수 출력 (포인터에 쓰면 위험!)
// %p    : 포인터 주소 출력 전용
// void* : 어떤 타입이든 가리킬 수 있는 범용 포인터
